Qt5_Ui.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Qt5 UI文件使用</title>
<!-- 2015-11-21 六 22:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="walter" />
<link rel="stylesheet" href="css/worg.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Qt5 UI文件使用</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">使用Designer绘制ui</a></li>
<li><a href="#sec-2">ui文件的使用方法</a>
<ul>
<li><a href="#sec-2-1">在编译时使用</a>
<ul>
<li><a href="#sec-2-1-1">ui文件的原理</a></li>
<li><a href="#sec-2-1-2">直接方式</a></li>
<li><a href="#sec-2-1-3">单继承方式</a></li>
<li><a href="#sec-2-1-4">双继承方式</a></li>
</ul>
</li>
<li><a href="#sec-2-2">在运行时动态加载</a></li>
</ul>
</li>
<li><a href="#sec-3">signal-slot自动关联</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">使用Designer绘制ui</h2>
<div class="outline-text-2" id="text-1">
<p>
可以绘制基于QDialog,QMainWindow和QWidget的图形。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">ui文件的使用方法</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">在编译时使用</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1">ui文件的原理</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
ui文件会被编译为ui_xxx.h头文件，头文件里定义了一个纯C++类，不继承自任何Qt类和Ui命名空间。
生成头文件的命令类似于，摘自官方的calculatorform例子:
</p>
<div class="org-src-container">

<pre class="src src-sh">/usr/lib/x86_64-linux-gnu/qt5/bin/uic ../calculatorform/calculatorform.ui \
-o ui_calculatorform.h
</pre>
</div>

<p>
可以有如下几种方式
</p>
<ol class="org-ol">
<li>直接方式
</li>
<li>单继承方式
</li>
<li>双继承方式
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2">直接方式</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
直接继承的缺点是，不好实现信号槽
</p>
</div>
</div>
<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3">单继承方式</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
单继承时，可以在类型里定义ui_xxx类的变量或者指针
</p>
</div>
</div>
<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4">双继承方式</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
双继承同时拥有Qt部件和ui_xxx的全部变量
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">在运行时动态加载</h3>
<div class="outline-text-3" id="text-2-2">
<p>
使用UiTools来动态加载构建图形部件。可以使用findChild，根据部件名称来获取对应部件的指针。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">signal-slot自动关联</h2>
<div class="outline-text-2" id="text-3">
<p>
slot需要定义成如下形式,在编译时使用时，在setupUi会自动生成QMetaObject的自动关联代码，
在使用动态加载的方法时，需要手动添加。
on_&lt;object_name&gt;_&lt;signal_name&gt;(&lt;signal parameters&gt;);
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: walter</p>
<p class="date">Created: 2015-11-21 六 22:08</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
